export const palette0 = [
  { r: 1.0, g: 1.0, b: 1.0, a: 1.0 }, // 白
  { r: 0.57, g: 0.09, b: 0.4, a: 1.0 }, // マゼンタ
  { r: 0.38, g: 0.2, b: 0.8, a: 1.0 }, // 紫
  { r: 0.2, g: 1.0, b: 0.7, a: 1.0 }, // エメラルド
  { r: 1.0, g: 1.0, b: 0.3, a: 1.0 }, // 蛍光イエロー
  { r: 0.13, g: 0.03, b: 0.9, a: 1.0 }, // ダークグリーン
];

export const palette1 = [
  { r: 0.6, g: 0.8, b: 1.0, a: 1.0 },
  { r: 0.1, g: 0.4, b: 1.0, a: 1.0 },
  { r: 0.4, g: 0.2, b: 0.8, a: 1.0 },
  { r: 0.2, g: 1.0, b: 0.7, a: 1.0 },
  { r: 1.0, g: 1.0, b: 0.3, a: 1.0 },
  { r: 1.0, g: 0.95, b: 0.9, a: 1.0 },
];

export const palette2 = [
  { r: 1.0, g: 0.1, b: 0.4, a: 1.0 },
  { r: 0.6, g: 0.8, b: 1.0, a: 1.0 },
  { r: 0.5, g: 0.9, b: 0.5, a: 1.0 },
  { r: 1.0, g: 1.0, b: 1.0, a: 1.0 },
  { r: 0.2, g: 0.2, b: 1.0, a: 1.0 },
  { r: 0.2, g: 0.4, b: 1.0, a: 1.0 },
];

export const colorSet = {
  palette0,
  palette1,
  palette2,
};
